{
  "programming": [
    "How do I implement a binary search tree in Python?",
    "What is the difference between async and await in JavaScript?",
    "Explain the concept of garbage collection in Java",
    "How do I optimize SQL queries for better performance?",
    "What are design patterns and when should I use them?",
    "How do I handle memory leaks in C++?",
    "What is the difference between REST and GraphQL APIs?",
    "How do I implement authentication using JWT tokens?",
    "Explain the concept of dependency injection",
    "What are microservices and how do they differ from monoliths?",
    "How do I write unit tests for async functions?",
    "What is the difference between let, const, and var in JavaScript?",
    "How do I implement a hash table from scratch?",
    "Explain the concept of recursion and when to use it",
    "What are the best practices for code review?",
    "How do I optimize database queries with indexes?",
    "What is the difference between shallow copy and deep copy?",
    "How do I implement a queue using stacks?",
    "Explain the concept of polymorphism in object-oriented programming",
    "What are the SOLID principles in software design?",
    "How do I handle errors in Python exception handling?",
    "What is the difference between process and thread?",
    "How do I implement caching strategies in web applications?",
    "Explain the concept of closures in JavaScript",
    "What are the differences between TCP and UDP protocols?",
    "How do I optimize React component rendering?",
    "What is the difference between compiled and interpreted languages?",
    "How do I implement a linked list data structure?",
    "Explain the concept of virtual memory",
    "What are the best practices for API versioning?",
    "How do I implement a sorting algorithm like quicksort?",
    "What is the difference between SQL and NoSQL databases?",
    "How do I handle concurrency issues in multi-threaded applications?",
    "Explain the concept of event-driven architecture",
    "What are the differences between Docker and Kubernetes?",
    "How do I implement a graph data structure?",
    "What is the difference between functional and imperative programming?",
    "How do I optimize frontend performance?",
    "Explain the concept of memoization",
    "What are the best practices for secure coding?",
    "How do I implement a stack data structure?",
    "What is the difference between Git merge and rebase?",
    "How do I handle state management in React applications?",
    "Explain the concept of load balancing",
    "What are the differences between relational and document databases?",
    "How do I implement a binary tree traversal algorithm?",
    "What is the difference between static and dynamic typing?",
    "How do I optimize memory usage in Python?",
    "Explain the concept of distributed systems",
    "What are the best practices for code documentation?"
  ],
  "science": [
    "What is the difference between DNA and RNA?",
    "Explain the process of photosynthesis",
    "How do black holes form and what happens inside them?",
    "What is the theory of relativity and how does it work?",
    "Explain the structure of an atom",
    "What causes climate change and how can we mitigate it?",
    "How do vaccines work to protect against diseases?",
    "What is quantum mechanics and why is it important?",
    "Explain the water cycle and its importance",
    "What are the different states of matter?",
    "How do cells divide through mitosis and meiosis?",
    "What is the difference between acids and bases?",
    "Explain the concept of evolution by natural selection",
    "How do earthquakes occur and how are they measured?",
    "What is the greenhouse effect?",
    "Explain the structure and function of the human brain",
    "What are the different types of chemical bonds?",
    "How do stars form and what determines their lifespan?",
    "What is the difference between renewable and non-renewable energy?",
    "Explain the process of cellular respiration",
    "What causes the seasons on Earth?",
    "How do antibiotics work and why do bacteria become resistant?",
    "What is the difference between weather and climate?",
    "Explain the concept of plate tectonics",
    "What are the different types of ecosystems?",
    "How do enzymes function in biological processes?",
    "What is the difference between prokaryotic and eukaryotic cells?",
    "Explain the concept of entropy in thermodynamics",
    "How do plants reproduce?",
    "What are the different layers of the Earth's atmosphere?",
    "How do hormones regulate body functions?",
    "What is the difference between speed and velocity?",
    "Explain the concept of genetic inheritance",
    "How do ocean currents affect global climate?",
    "What are the different types of energy?",
    "How do the immune system cells fight infections?",
    "What is the difference between mass and weight?",
    "Explain the process of protein synthesis",
    "How do volcanoes form and erupt?",
    "What are the different types of chemical reactions?",
    "How do animals adapt to their environments?",
    "What is the difference between potential and kinetic energy?",
    "Explain the concept of biodiversity",
    "How do the nervous and endocrine systems work together?",
    "What are the different types of rocks and how do they form?",
    "How do mutations occur in DNA?",
    "What is the difference between conductors and insulators?",
    "Explain the concept of the carbon cycle",
    "How do telescopes help us study the universe?",
    "What are the different types of waves and their properties?"
  ],
  "mathematics": [
    "What is the Pythagorean theorem and how is it used?",
    "Explain the concept of derivatives in calculus",
    "How do you solve quadratic equations?",
    "What is the difference between mean, median, and mode?",
    "Explain the concept of limits in calculus",
    "How do you calculate the area of a circle?",
    "What is the Fibonacci sequence and where does it appear?",
    "Explain the concept of probability and how to calculate it",
    "How do you solve systems of linear equations?",
    "What is the difference between permutation and combination?",
    "Explain the concept of integrals in calculus",
    "How do you find the slope of a line?",
    "What is the difference between prime and composite numbers?",
    "Explain the concept of logarithms",
    "How do you calculate compound interest?",
    "What is the difference between correlation and causation?",
    "Explain the concept of matrices and matrix operations",
    "How do you solve trigonometric equations?",
    "What is the difference between discrete and continuous mathematics?",
    "Explain the concept of series and sequences",
    "How do you calculate the volume of a sphere?",
    "What is the difference between rational and irrational numbers?",
    "Explain the concept of vectors and vector operations",
    "How do you solve differential equations?",
    "What is the difference between independent and dependent variables?",
    "Explain the concept of graph theory",
    "How do you calculate standard deviation?",
    "What is the difference between linear and nonlinear functions?",
    "Explain the concept of optimization problems",
    "How do you find the roots of a polynomial equation?",
    "What is the difference between Euclidean and non-Euclidean geometry?",
    "Explain the concept of number theory",
    "How do you calculate the perimeter of different shapes?",
    "What is the difference between parametric and non-parametric statistics?",
    "Explain the concept of topology",
    "How do you solve inequalities?",
    "What is the difference between convergent and divergent series?",
    "Explain the concept of complex numbers",
    "How do you calculate the surface area of a cylinder?",
    "What is the difference between discrete and continuous probability distributions?",
    "Explain the concept of linear algebra",
    "How do you find the maximum or minimum of a function?",
    "What is the difference between arithmetic and geometric sequences?",
    "Explain the concept of set theory",
    "How do you calculate the area under a curve?",
    "What is the difference between deterministic and stochastic processes?",
    "Explain the concept of fractals",
    "How do you solve exponential equations?",
    "What is the difference between sample and population in statistics?",
    "Explain the concept of abstract algebra"
  ],
  "literature": [
    "What are the main themes in Shakespeare's Hamlet?",
    "Explain the concept of symbolism in literature",
    "How do authors use foreshadowing in their narratives?",
    "What is the difference between first-person and third-person narration?",
    "Explain the concept of the hero's journey",
    "What are the characteristics of Romantic literature?",
    "How do poets use meter and rhyme in their works?",
    "What is the difference between plot and theme?",
    "Explain the concept of dramatic irony",
    "What are the main elements of a short story?",
    "How do authors develop character arcs?",
    "What is the difference between metaphor and simile?",
    "Explain the concept of stream of consciousness",
    "What are the characteristics of Gothic literature?",
    "How do authors use imagery to enhance their writing?",
    "What is the difference between static and dynamic characters?",
    "Explain the concept of the unreliable narrator",
    "What are the main themes in George Orwell's 1984?",
    "How do authors use dialogue to reveal character?",
    "What is the difference between tragedy and comedy?",
    "Explain the concept of intertextuality",
    "What are the characteristics of Modernist literature?",
    "How do poets use enjambment in their verse?",
    "What is the difference between denotation and connotation?",
    "Explain the concept of the bildungsroman",
    "What are the main themes in Jane Austen's Pride and Prejudice?",
    "How do authors use setting to create atmosphere?",
    "What is the difference between round and flat characters?",
    "Explain the concept of magical realism",
    "What are the characteristics of Postmodern literature?",
    "How do authors use point of view to shape narrative?",
    "What is the difference between alliteration and assonance?",
    "Explain the concept of the anti-hero",
    "What are the main themes in F. Scott Fitzgerald's The Great Gatsby?",
    "How do authors use conflict to drive plot?",
    "What is the difference between prose and poetry?",
    "Explain the concept of the frame narrative",
    "What are the characteristics of Realist literature?",
    "How do authors use tone to convey meaning?",
    "What is the difference between literal and figurative language?",
    "Explain the concept of the quest narrative",
    "What are the main themes in Harper Lee's To Kill a Mockingbird?",
    "How do authors use flashback in their narratives?",
    "What is the difference between protagonist and antagonist?",
    "Explain the concept of the epistolary novel",
    "What are the characteristics of Naturalist literature?",
    "How do authors use repetition for emphasis?",
    "What is the difference between hyperbole and understatement?",
    "Explain the concept of the picaresque novel",
    "What are the main elements of literary analysis?"
  ],
  "history": [
    "What were the main causes of World War I?",
    "Explain the significance of the Renaissance period",
    "How did the Industrial Revolution change society?",
    "What were the key events of the American Civil War?",
    "Explain the impact of the French Revolution",
    "What were the main causes of World War II?",
    "How did the Roman Empire rise and fall?",
    "What was the significance of the Magna Carta?",
    "Explain the causes and effects of the Great Depression",
    "What were the key events of the Cold War?",
    "How did the Byzantine Empire influence European history?",
    "What was the significance of the Protestant Reformation?",
    "Explain the impact of the Black Death on medieval Europe",
    "What were the main causes of the Russian Revolution?",
    "How did ancient Greek civilization influence Western culture?",
    "What was the significance of the Battle of Hastings?",
    "Explain the causes and effects of the American Revolution",
    "What were the key events of the Vietnam War?",
    "How did the Mongol Empire expand across Asia?",
    "What was the significance of the fall of the Berlin Wall?",
    "Explain the impact of the printing press on society",
    "What were the main causes of the Spanish Civil War?",
    "How did ancient Egyptian civilization develop?",
    "What was the significance of the Treaty of Versailles?",
    "Explain the causes and effects of the Crusades",
    "What were the key events of the Civil Rights Movement?",
    "How did the Chinese dynasties shape Asian history?",
    "What was the significance of the Battle of Waterloo?",
    "Explain the impact of colonialism on indigenous peoples",
    "What were the main causes of the Hundred Years' War?",
    "How did the Ottoman Empire rise to power?",
    "What was the significance of the Emancipation Proclamation?",
    "Explain the causes and effects of the Mexican Revolution",
    "What were the key events of the Space Race?",
    "How did ancient Roman law influence modern legal systems?",
    "What was the significance of the Battle of Gettysburg?",
    "Explain the impact of the transatlantic slave trade",
    "What were the main causes of the Korean War?",
    "How did the Islamic Golden Age contribute to knowledge?",
    "What was the significance of the fall of Constantinople?",
    "Explain the causes and effects of the Irish Potato Famine",
    "What were the key events of the Women's Suffrage Movement?",
    "How did the Mayan civilization develop in Mesoamerica?",
    "What was the significance of the D-Day landings?",
    "Explain the impact of the Age of Exploration",
    "What were the main causes of the Thirty Years' War?",
    "How did the British Empire expand globally?",
    "What was the significance of the Declaration of Independence?",
    "Explain the causes and effects of the Partition of India",
    "What were the key events of the Arab Spring?",
    "How did ancient Mesopotamian civilizations develop?"
  ],
  "medicine": [
    "What are the symptoms and treatment of diabetes?",
    "Explain how the cardiovascular system works",
    "How do antibiotics work to fight bacterial infections?",
    "What are the causes and prevention of heart disease?",
    "Explain the process of blood circulation",
    "What are the symptoms and treatment of hypertension?",
    "How does the immune system protect the body?",
    "What are the different types of cancer and their treatments?",
    "Explain the structure and function of the human heart",
    "What are the causes and symptoms of asthma?",
    "How do vaccines prevent diseases?",
    "What are the symptoms and treatment of depression?",
    "Explain the process of digestion",
    "What are the risk factors for stroke?",
    "How does the nervous system transmit signals?",
    "What are the symptoms and treatment of arthritis?",
    "Explain the function of the respiratory system",
    "What are the causes and prevention of osteoporosis?",
    "How do pain medications work?",
    "What are the symptoms and treatment of migraines?",
    "Explain the structure and function of the kidneys",
    "What are the causes and symptoms of Alzheimer's disease?",
    "How does the endocrine system regulate hormones?",
    "What are the symptoms and treatment of pneumonia?",
    "Explain the process of wound healing",
    "What are the risk factors for developing diabetes?",
    "How do anti-inflammatory drugs work?",
    "What are the symptoms and treatment of anxiety disorders?",
    "Explain the function of the liver",
    "What are the causes and prevention of kidney stones?",
    "How does anesthesia work during surgery?",
    "What are the symptoms and treatment of thyroid disorders?",
    "Explain the structure and function of the lungs",
    "What are the causes and symptoms of Parkinson's disease?",
    "How do antihistamines work?",
    "What are the symptoms and treatment of gastroenteritis?",
    "Explain the process of blood clotting",
    "What are the risk factors for heart attack?",
    "How does the lymphatic system function?",
    "What are the symptoms and treatment of epilepsy?",
    "Explain the function of the pancreas",
    "What are the causes and prevention of liver disease?",
    "How do antidepressants work?",
    "What are the symptoms and treatment of bronchitis?",
    "Explain the structure and function of the brain",
    "What are the causes and symptoms of multiple sclerosis?",
    "How do blood pressure medications work?",
    "What are the symptoms and treatment of urinary tract infections?",
    "Explain the process of bone formation and remodeling",
    "What are the risk factors for developing cancer?"
  ],
  "business": [
    "What is the difference between revenue and profit?",
    "Explain the concept of supply and demand",
    "How do companies determine their pricing strategy?",
    "What are the key components of a business plan?",
    "Explain the concept of market segmentation",
    "What is the difference between assets and liabilities?",
    "How do companies measure customer satisfaction?",
    "What are the main types of business structures?",
    "Explain the concept of competitive advantage",
    "What is the difference between marketing and advertising?",
    "How do companies manage cash flow?",
    "What are the key principles of project management?",
    "Explain the concept of economies of scale",
    "What is the difference between fixed and variable costs?",
    "How do companies develop their brand identity?",
    "What are the main methods of business valuation?",
    "Explain the concept of customer lifetime value",
    "What is the difference between B2B and B2C business models?",
    "How do companies manage inventory?",
    "What are the key elements of effective leadership?",
    "Explain the concept of return on investment",
    "What is the difference between equity and debt financing?",
    "How do companies conduct market research?",
    "What are the main types of financial statements?",
    "Explain the concept of lean startup methodology",
    "What is the difference between gross margin and net margin?",
    "How do companies build customer relationships?",
    "What are the key principles of change management?",
    "Explain the concept of blue ocean strategy",
    "What is the difference between sales and marketing?",
    "How do companies manage risk?",
    "What are the main types of business partnerships?",
    "Explain the concept of value proposition",
    "What is the difference between income statement and balance sheet?",
    "How do companies develop their go-to-market strategy?",
    "What are the key elements of effective communication?",
    "Explain the concept of disruptive innovation",
    "What is the difference between direct and indirect costs?",
    "How do companies measure employee performance?",
    "What are the main types of business models?",
    "Explain the concept of customer acquisition cost",
    "What is the difference between profit and cash flow?",
    "How do companies build strategic partnerships?",
    "What are the key principles of organizational culture?",
    "Explain the concept of market penetration",
    "What is the difference between accounts receivable and accounts payable?",
    "How do companies develop their product roadmap?",
    "What are the main types of business strategies?",
    "Explain the concept of break-even analysis",
    "What is the difference between short-term and long-term goals?",
    "How do companies measure business success?"
  ],
  "technology": [
    "What is the difference between artificial intelligence and machine learning?",
    "Explain how blockchain technology works",
    "How do cloud computing services function?",
    "What are the main components of a computer system?",
    "Explain the concept of cybersecurity threats",
    "What is the difference between HTTP and HTTPS?",
    "How do neural networks learn from data?",
    "What are the main types of databases?",
    "Explain the concept of the Internet of Things",
    "What is the difference between RAM and ROM?",
    "How do encryption algorithms protect data?",
    "What are the main types of operating systems?",
    "Explain the concept of virtual reality",
    "What is the difference between software and hardware?",
    "How do search engines index web pages?",
    "What are the main types of computer networks?",
    "Explain the concept of quantum computing",
    "What is the difference between frontend and backend development?",
    "How do recommendation systems work?",
    "What are the main types of programming languages?",
    "Explain the concept of edge computing",
    "What is the difference between IPv4 and IPv6?",
    "How do biometric authentication systems work?",
    "What are the main types of storage devices?",
    "Explain the concept of augmented reality",
    "What is the difference between data and information?",
    "How do content delivery networks work?",
    "What are the main types of software licenses?",
    "Explain the concept of 5G technology",
    "What is the difference between client-server and peer-to-peer networks?",
    "How do facial recognition systems work?",
    "What are the main types of computer viruses?",
    "Explain the concept of big data analytics",
    "What is the difference between analog and digital signals?",
    "How do voice assistants process natural language?",
    "What are the main types of cloud deployment models?",
    "Explain the concept of self-driving cars",
    "What is the difference between firmware and software?",
    "How do distributed systems handle failures?",
    "What are the main types of authentication methods?",
    "Explain the concept of machine learning algorithms",
    "What is the difference between bandwidth and latency?",
    "How do social media algorithms work?",
    "What are the main types of computer architectures?",
    "Explain the concept of smart cities",
    "What is the difference between lossless and lossy compression?",
    "How do recommendation algorithms personalize content?",
    "What are the main types of network topologies?",
    "Explain the concept of digital transformation",
    "What is the difference between synchronous and asynchronous communication?"
  ],
  "philosophy": [
    "What is the difference between ethics and morality?",
    "Explain the concept of free will",
    "How do philosophers define knowledge?",
    "What are the main branches of philosophy?",
    "Explain the concept of the mind-body problem",
    "What is the difference between determinism and free will?",
    "How do philosophers approach the question of existence?",
    "What are the main theories of truth?",
    "Explain the concept of the categorical imperative",
    "What is the difference between a priori and a posteriori knowledge?",
    "How do philosophers define justice?",
    "What are the main ethical theories?",
    "Explain the concept of the problem of evil",
    "What is the difference between utilitarianism and deontology?",
    "How do philosophers understand consciousness?",
    "What are the main arguments for the existence of God?",
    "Explain the concept of the social contract",
    "What is the difference between realism and idealism?",
    "How do philosophers approach the question of personal identity?",
    "What are the main theories of meaning?",
    "Explain the concept of the trolley problem",
    "What is the difference between skepticism and dogmatism?",
    "How do philosophers define beauty?",
    "What are the main theories of mind?",
    "Explain the concept of the veil of ignorance",
    "What is the difference between necessary and contingent truths?",
    "How do philosophers understand time?",
    "What are the main arguments against free will?",
    "Explain the concept of virtue ethics",
    "What is the difference between analytic and continental philosophy?",
    "How do philosophers approach the question of other minds?",
    "What are the main theories of perception?",
    "Explain the concept of the ship of Theseus",
    "What is the difference between substance and property dualism?",
    "How do philosophers define happiness?",
    "What are the main theories of language?",
    "Explain the concept of the categorical imperative",
    "What is the difference between moral relativism and moral absolutism?",
    "How do philosophers understand causation?",
    "What are the main arguments for skepticism?",
    "Explain the concept of the greatest happiness principle",
    "What is the difference between rationalism and empiricism?",
    "How do philosophers approach the question of universals?",
    "What are the main theories of personal identity?",
    "Explain the concept of the state of nature",
    "What is the difference between consequentialism and non-consequentialism?",
    "How do philosophers define art?",
    "What are the main theories of reference?",
    "Explain the concept of the problem of induction",
    "What is the difference between monism and dualism?"
  ],
  "art": [
    "What are the main elements of visual art?",
    "Explain the concept of color theory",
    "How do artists use perspective in their work?",
    "What are the different art movements throughout history?",
    "Explain the concept of composition in art",
    "What is the difference between abstract and representational art?",
    "How do artists use light and shadow?",
    "What are the main techniques in oil painting?",
    "Explain the concept of art criticism",
    "What is the difference between modern and contemporary art?",
    "How do artists create depth in two-dimensional works?",
    "What are the main principles of design?",
    "Explain the concept of artistic style",
    "What is the difference between fine art and applied art?",
    "How do artists use texture in their work?",
    "What are the main types of sculpture techniques?",
    "Explain the concept of art history",
    "What is the difference between impressionism and expressionism?",
    "How do artists use color harmony?",
    "What are the main techniques in watercolor painting?",
    "Explain the concept of artistic interpretation",
    "What is the difference between realism and surrealism?",
    "How do artists create visual rhythm?",
    "What are the main types of printmaking?",
    "Explain the concept of artistic medium",
    "What is the difference between classical and romantic art?",
    "How do artists use line in their compositions?",
    "What are the main techniques in drawing?",
    "Explain the concept of art appreciation",
    "What is the difference between two-dimensional and three-dimensional art?",
    "How do artists use contrast in their work?",
    "What are the main types of artistic media?",
    "Explain the concept of artistic movement",
    "What is the difference between figurative and non-figurative art?",
    "How do artists create focal points?",
    "What are the main techniques in digital art?",
    "Explain the concept of art theory",
    "What is the difference between traditional and digital art?",
    "How do artists use balance in their compositions?",
    "What are the main types of painting styles?",
    "Explain the concept of artistic expression",
    "What is the difference between art and craft?",
    "How do artists use proportion in their work?",
    "What are the main techniques in photography?",
    "Explain the concept of artistic value",
    "What is the difference between public and private art?",
    "How do artists create unity in their compositions?",
    "What are the main types of artistic genres?",
    "Explain the concept of artistic innovation",
    "What is the difference between original and reproduction art?",
    "How do artists develop their artistic voice?"
  ],
  "education": [
    "What are the different learning styles?",
    "Explain the concept of differentiated instruction",
    "How do teachers assess student learning?",
    "What are the main theories of learning?",
    "Explain the concept of active learning",
    "What is the difference between formative and summative assessment?",
    "How do educators create inclusive classrooms?",
    "What are the main types of educational technology?",
    "Explain the concept of Bloom's taxonomy",
    "What is the difference between teaching and learning?",
    "How do teachers manage classroom behavior?",
    "What are the main approaches to curriculum design?",
    "Explain the concept of student-centered learning",
    "What is the difference between pedagogy and andragogy?",
    "How do educators promote critical thinking?",
    "What are the main types of educational assessments?",
    "Explain the concept of scaffolding in education",
    "What is the difference between traditional and progressive education?",
    "How do teachers differentiate instruction?",
    "What are the main theories of motivation in education?",
    "Explain the concept of metacognition",
    "What is the difference between intrinsic and extrinsic motivation?",
    "How do educators use technology in the classroom?",
    "What are the main types of learning disabilities?",
    "Explain the concept of cooperative learning",
    "What is the difference between synchronous and asynchronous learning?",
    "How do teachers create engaging lesson plans?",
    "What are the main approaches to reading instruction?",
    "Explain the concept of project-based learning",
    "What is the difference between rote learning and meaningful learning?",
    "How do educators assess student progress?",
    "What are the main types of educational research methods?",
    "Explain the concept of learning objectives",
    "What is the difference between assessment and evaluation?",
    "How do teachers accommodate diverse learners?",
    "What are the main theories of cognitive development?",
    "Explain the concept of flipped classroom",
    "What is the difference between learning and performance?",
    "How do educators promote student engagement?",
    "What are the main types of instructional strategies?",
    "Explain the concept of authentic assessment",
    "What is the difference between direct and indirect instruction?",
    "How do teachers provide effective feedback?",
    "What are the main approaches to mathematics education?",
    "Explain the concept of social learning theory",
    "What is the difference between individual and group learning?",
    "How do educators create culturally responsive classrooms?",
    "What are the main types of educational interventions?",
    "Explain the concept of mastery learning",
    "What is the difference between learning goals and learning objectives?",
    "How do teachers support struggling students?"
  ],
  "law": [
    "What is the difference between civil and criminal law?",
    "Explain the concept of due process",
    "How do courts interpret the Constitution?",
    "What are the main sources of law?",
    "Explain the concept of precedent in legal systems",
    "What is the difference between common law and civil law?",
    "How do contracts become legally binding?",
    "What are the main types of legal systems?",
    "Explain the concept of jurisdiction",
    "What is the difference between tort and contract law?",
    "How do courts determine liability?",
    "What are the main principles of criminal law?",
    "Explain the concept of legal standing",
    "What is the difference between misdemeanor and felony?",
    "How do lawyers build a case?",
    "What are the main types of evidence?",
    "Explain the concept of burden of proof",
    "What is the difference between plaintiff and defendant?",
    "How do courts ensure fair trials?",
    "What are the main types of legal remedies?",
    "Explain the concept of legal precedent",
    "What is the difference between statute and case law?",
    "How do judges make decisions?",
    "What are the main principles of contract law?",
    "Explain the concept of legal liability",
    "What is the difference between civil and criminal procedure?",
    "How do legal systems protect individual rights?",
    "What are the main types of intellectual property?",
    "Explain the concept of legal causation",
    "What is the difference between intentional and negligent torts?",
    "How do courts interpret statutes?",
    "What are the main principles of property law?",
    "Explain the concept of legal duty",
    "What is the difference between direct and circumstantial evidence?",
    "How do legal systems handle disputes?",
    "What are the main types of legal defenses?",
    "Explain the concept of legal capacity",
    "What is the difference between substantive and procedural law?",
    "How do courts apply the law to facts?",
    "What are the main principles of family law?",
    "Explain the concept of legal damages",
    "What is the difference between criminal and civil liability?",
    "How do legal systems ensure justice?",
    "What are the main types of legal proceedings?",
    "Explain the concept of legal rights",
    "What is the difference between law and equity?",
    "How do courts balance competing interests?",
    "What are the main principles of administrative law?",
    "Explain the concept of legal obligation",
    "What is the difference between public and private law?",
    "How do legal systems evolve over time?"
  ],
  "cooking": [
    "How do you properly season a steak before cooking?",
    "What is the difference between baking and roasting?",
    "How do you make a perfect French omelette?",
    "What are the essential knife skills for cooking?",
    "How do you properly cook pasta al dente?",
    "What is the difference between sautéing and pan-frying?",
    "How do you make a roux for sauces?",
    "What are the different types of cooking methods?",
    "How do you properly braise meat?",
    "What is the difference between herbs and spices?",
    "How do you make homemade bread from scratch?",
    "What are the key techniques for making perfect rice?",
    "How do you properly temper chocolate?",
    "What is the difference between stock and broth?",
    "How do you make a perfect hollandaise sauce?",
    "What are the essential ingredients for Italian cooking?",
    "How do you properly sear meat?",
    "What is the difference between proofing and rising dough?",
    "How do you make a classic French mirepoix?",
    "What are the different types of pasta shapes and their uses?",
    "How do you properly cook vegetables to retain nutrients?",
    "What is the difference between marinating and brining?",
    "How do you make a perfect pie crust?",
    "What are the key techniques for making sushi?",
    "How do you properly deglaze a pan?",
    "What is the difference between baking powder and baking soda?",
    "How do you make homemade pasta?",
    "What are the essential tools for a well-equipped kitchen?",
    "How do you properly smoke meat?",
    "What is the difference between clarified butter and regular butter?",
    "How do you make a perfect risotto?",
    "What are the key techniques for making desserts?",
    "How do you properly ferment foods?",
    "What is the difference between poaching and simmering?",
    "How do you make a classic vinaigrette?",
    "What are the different types of cooking oils and their uses?",
    "How do you properly grill vegetables?",
    "What is the difference between yeast and sourdough starter?",
    "How do you make a perfect soufflé?",
    "What are the key techniques for making sauces?",
    "How do you properly cure meat?",
    "What is the difference between dry heat and moist heat cooking?",
    "How do you make homemade ice cream?",
    "What are the essential spices for Indian cooking?",
    "How do you properly steam food?",
    "What is the difference between confit and braising?",
    "How do you make a perfect crème brûlée?",
    "What are the key techniques for making soups?",
    "How do you properly pickle vegetables?",
    "What is the difference between flambéing and torching?"
  ],
  "sports": [
    "What are the rules of basketball?",
    "How do you improve your running form?",
    "What is the difference between aerobic and anaerobic exercise?",
    "How do you train for a marathon?",
    "What are the basic techniques in tennis?",
    "How do you improve your golf swing?",
    "What is the difference between strength and endurance training?",
    "How do you prevent sports injuries?",
    "What are the rules of soccer?",
    "How do you improve your swimming technique?",
    "What is the difference between static and dynamic stretching?",
    "How do you train for powerlifting?",
    "What are the basic techniques in boxing?",
    "How do you improve your cycling performance?",
    "What is the difference between HIIT and steady-state cardio?",
    "How do you develop better coordination?",
    "What are the rules of American football?",
    "How do you improve your vertical jump?",
    "What is the difference between plyometric and isometric training?",
    "How do you train for triathlons?",
    "What are the basic techniques in martial arts?",
    "How do you improve your flexibility?",
    "What is the difference between compound and isolation exercises?",
    "How do you develop better balance?",
    "What are the rules of baseball?",
    "How do you improve your reaction time?",
    "What is the difference between periodization and linear progression?",
    "How do you train for rock climbing?",
    "What are the basic techniques in volleyball?",
    "How do you improve your agility?",
    "What is the difference between active and passive recovery?",
    "How do you develop better speed?",
    "What are the rules of ice hockey?",
    "How do you improve your endurance?",
    "What is the difference between overtraining and overreaching?",
    "How do you train for crossfit?",
    "What are the basic techniques in wrestling?",
    "How do you improve your power output?",
    "What is the difference between mobility and flexibility?",
    "How do you develop better proprioception?",
    "What are the rules of rugby?",
    "How do you improve your mental game in sports?",
    "What is the difference between tapering and deloading?",
    "How do you train for obstacle course racing?",
    "What are the basic techniques in track and field?",
    "How do you improve your sports performance?",
    "What is the difference between pre-workout and post-workout nutrition?",
    "How do you develop better sports-specific skills?",
    "What are the key principles of sports psychology?",
    "How do you prevent and treat muscle soreness?"
  ],
  "music": [
    "What are the basic elements of music theory?",
    "How do you read sheet music?",
    "What is the difference between major and minor scales?",
    "How do you play guitar chords?",
    "What are the different types of musical instruments?",
    "How do you develop perfect pitch?",
    "What is the difference between rhythm and tempo?",
    "How do you write a song?",
    "What are the basic piano techniques?",
    "How do you sing in tune?",
    "What is the difference between harmony and melody?",
    "How do you play drums?",
    "What are the different musical genres?",
    "How do you improve your musical ear?",
    "What is the difference between time signatures?",
    "How do you compose music?",
    "What are the basic violin techniques?",
    "How do you use music production software?",
    "What is the difference between acoustic and electric instruments?",
    "How do you practice effectively?",
    "What are the different types of musical notation?",
    "How do you play bass guitar?",
    "What is the difference between consonance and dissonance?",
    "How do you arrange music for different instruments?",
    "What are the basic techniques for wind instruments?",
    "How do you mix and master audio?",
    "What is the difference between polyphony and homophony?",
    "How do you improvise in jazz?",
    "What are the different types of musical forms?",
    "How do you play keyboard instruments?",
    "What is the difference between staccato and legato?",
    "How do you record music?",
    "What are the basic techniques for string instruments?",
    "How do you understand chord progressions?",
    "What is the difference between dynamics and articulation?",
    "How do you play percussion instruments?",
    "What are the different types of musical intervals?",
    "How do you develop musical creativity?",
    "What is the difference between tonality and atonality?",
    "How do you play brass instruments?",
    "What are the basic techniques for vocal performance?",
    "How do you understand musical modes?",
    "What is the difference between syncopation and regular rhythm?",
    "How do you play woodwind instruments?",
    "What are the different types of musical textures?",
    "How do you develop musical expression?",
    "What is the difference between pitch and frequency?",
    "How do you understand musical cadences?",
    "What are the key principles of music composition?",
    "How do you develop better musical timing?"
  ],
  "travel": [
    "What are the best travel destinations for budget travelers?",
    "How do you plan an international trip?",
    "What is the difference between a passport and a visa?",
    "How do you find cheap flights?",
    "What are the essential items to pack for travel?",
    "How do you avoid jet lag?",
    "What is the difference between travel insurance types?",
    "How do you navigate airports efficiently?",
    "What are the best travel apps?",
    "How do you stay safe while traveling?",
    "What is the difference between hostels and hotels?",
    "How do you budget for a trip?",
    "What are the key cultural etiquette tips for travelers?",
    "How do you handle travel emergencies?",
    "What is the difference between direct and connecting flights?",
    "How do you pack efficiently?",
    "What are the best ways to experience local culture?",
    "How do you deal with language barriers?",
    "What is the difference between travel agents and booking yourself?",
    "How do you find authentic local experiences?",
    "What are the essential travel documents?",
    "How do you manage money while traveling?",
    "What is the difference between travel credit cards?",
    "How do you choose the right accommodation?",
    "What are the best travel photography tips?",
    "How do you plan a road trip?",
    "What is the difference between solo and group travel?",
    "How do you find the best local food?",
    "What are the key tips for backpacking?",
    "How do you handle travel delays?",
    "What is the difference between tourist and off-the-beaten-path destinations?",
    "How do you plan a multi-city trip?",
    "What are the best ways to save money while traveling?",
    "How do you stay healthy while traveling?",
    "What is the difference between travel seasons?",
    "How do you plan adventure travel?",
    "What are the essential tips for first-time travelers?",
    "How do you handle currency exchange?",
    "What is the difference between travel packages and independent travel?",
    "How do you plan a family vacation?",
    "What are the best travel destinations for different seasons?",
    "How do you find travel deals?",
    "What is the difference between travel modes?",
    "How do you plan a luxury trip?",
    "What are the key tips for sustainable travel?",
    "How do you handle travel anxiety?",
    "What is the difference between travel styles?",
    "How do you plan a weekend getaway?",
    "What are the best travel destinations for different interests?",
    "How do you create a travel itinerary?"
  ],
  "fashion": [
    "What are the basic principles of fashion design?",
    "How do you build a capsule wardrobe?",
    "What is the difference between haute couture and ready-to-wear?",
    "How do you dress for your body type?",
    "What are the different fashion styles?",
    "How do you accessorize an outfit?",
    "What is the difference between fashion trends and timeless pieces?",
    "How do you choose colors that complement your skin tone?",
    "What are the essential wardrobe pieces?",
    "How do you mix and match patterns?",
    "What is the difference between fast fashion and sustainable fashion?",
    "How do you dress for different occasions?",
    "What are the key elements of personal style?",
    "How do you care for different fabric types?",
    "What is the difference between formal and casual wear?",
    "How do you layer clothing effectively?",
    "What are the different types of fashion accessories?",
    "How do you find your personal style?",
    "What is the difference between fashion seasons?",
    "How do you dress professionally?",
    "What are the key principles of color coordination?",
    "How do you choose the right fit?",
    "What is the difference between fashion brands?",
    "How do you style statement pieces?",
    "What are the essential fashion tips for men?",
    "How do you dress for different weather conditions?",
    "What is the difference between fashion and style?",
    "How do you build a sustainable wardrobe?",
    "What are the key elements of fashion history?",
    "How do you choose the right shoes for an outfit?",
    "What is the difference between fashion weeks?",
    "How do you dress on a budget?",
    "What are the essential fashion tips for women?",
    "How do you understand fashion terminology?",
    "What is the difference between designer and high-street fashion?",
    "How do you style vintage pieces?",
    "What are the key principles of fashion photography?",
    "How do you dress for your age?",
    "What is the difference between fashion and costume?",
    "How do you care for luxury fashion items?",
    "What are the essential tips for fashion shopping?",
    "How do you understand fashion sizing?",
    "What is the difference between fashion and clothing?",
    "How do you style athleisure wear?",
    "What are the key elements of fashion marketing?",
    "How do you dress for different body shapes?",
    "What is the difference between fashion and trends?",
    "How do you build a versatile wardrobe?",
    "What are the essential fashion rules to break?",
    "How do you develop your fashion sense?"
  ],
  "agriculture": [
    "What are the different types of farming methods?",
    "How do you prepare soil for planting?",
    "What is the difference between organic and conventional farming?",
    "How do you grow vegetables from seeds?",
    "What are the essential tools for farming?",
    "How do you manage crop rotation?",
    "What is the difference between annual and perennial plants?",
    "How do you control pests naturally?",
    "What are the different types of irrigation systems?",
    "How do you improve soil fertility?",
    "What is the difference between heirloom and hybrid seeds?",
    "How do you harvest crops?",
    "What are the key principles of sustainable agriculture?",
    "How do you manage livestock?",
    "What is the difference between monoculture and polyculture?",
    "How do you start a farm?",
    "What are the different types of fertilizers?",
    "How do you manage water resources on a farm?",
    "What is the difference between farming and agriculture?",
    "How do you grow fruit trees?",
    "What are the essential skills for farming?",
    "How do you manage weeds?",
    "What is the difference between intensive and extensive farming?",
    "How do you raise chickens?",
    "What are the different types of crops?",
    "How do you manage farm equipment?",
    "What is the difference between farming seasons?",
    "How do you grow herbs?",
    "What are the key principles of permaculture?",
    "How do you manage farm finances?",
    "What is the difference between farming and gardening?",
    "How do you grow grains?",
    "What are the different types of farming systems?",
    "How do you manage farm animals?",
    "What is the difference between farming and ranching?",
    "How do you grow flowers?",
    "What are the essential tips for small-scale farming?",
    "How do you manage farm waste?",
    "What is the difference between farming and aquaculture?",
    "How do you grow mushrooms?",
    "What are the different types of agricultural practices?",
    "How do you manage farm labor?",
    "What is the difference between farming and forestry?",
    "How do you grow berries?",
    "What are the key principles of regenerative agriculture?",
    "How do you manage farm marketing?",
    "What is the difference between farming and agribusiness?",
    "How do you grow root vegetables?",
    "What are the essential tips for organic farming?",
    "How do you manage farm sustainability?"
  ],
  "architecture": [
    "What are the basic principles of architectural design?",
    "How do architects create building plans?",
    "What is the difference between modern and traditional architecture?",
    "How do you design sustainable buildings?",
    "What are the different architectural styles?",
    "How do architects use space planning?",
    "What is the difference between residential and commercial architecture?",
    "How do you design for natural light?",
    "What are the essential tools for architects?",
    "How do architects incorporate building codes?",
    "What is the difference between form and function in architecture?",
    "How do you design energy-efficient buildings?",
    "What are the key elements of architectural drawings?",
    "How do architects work with clients?",
    "What is the difference between architecture and engineering?",
    "How do you design accessible buildings?",
    "What are the different types of building materials?",
    "How do architects create 3D models?",
    "What is the difference between architecture and interior design?",
    "How do you design for different climates?",
    "What are the key principles of urban planning?",
    "How do architects manage construction projects?",
    "What is the difference between architecture and construction?",
    "How do you design green buildings?",
    "What are the essential skills for architects?",
    "How do architects use computer-aided design?",
    "What is the difference between architecture and landscape architecture?",
    "How do you design for safety?",
    "What are the different types of architectural structures?",
    "How do architects incorporate cultural elements?",
    "What is the difference between architecture and building design?",
    "How do you design for acoustics?",
    "What are the key elements of architectural history?",
    "How do architects work with contractors?",
    "What is the difference between architecture and structural engineering?",
    "How do you design for ventilation?",
    "What are the different types of architectural scales?",
    "How do architects create presentations?",
    "What is the difference between architecture and planning?",
    "How do you design for aesthetics?",
    "What are the essential tips for architectural students?",
    "How do architects use building information modeling?",
    "What is the difference between architecture and design?",
    "How do you design for different building types?",
    "What are the key principles of architectural theory?",
    "How do architects incorporate technology?",
    "What is the difference between architecture and building?",
    "How do you design for sustainability?",
    "What are the essential tips for architectural practice?",
    "How do architects manage design projects?"
  ],
  "psychology": [
    "What are the main branches of psychology?",
    "How do psychologists study human behavior?",
    "What is the difference between psychology and psychiatry?",
    "How do you understand cognitive processes?",
    "What are the different types of memory?",
    "How do psychologists treat mental disorders?",
    "What is the difference between nature and nurture?",
    "How do you understand human development?",
    "What are the key theories of personality?",
    "How do psychologists conduct research?",
    "What is the difference between classical and operant conditioning?",
    "How do you understand emotions?",
    "What are the different types of learning?",
    "How do psychologists assess mental health?",
    "What is the difference between psychology and neuroscience?",
    "How do you understand social behavior?",
    "What are the key principles of cognitive psychology?",
    "How do psychologists help with therapy?",
    "What is the difference between psychology and sociology?",
    "How do you understand motivation?",
    "What are the different types of psychological disorders?",
    "How do psychologists study perception?",
    "What is the difference between psychology and philosophy?",
    "How do you understand consciousness?",
    "What are the key theories of intelligence?",
    "How do psychologists measure behavior?",
    "What is the difference between psychology and behavioral science?",
    "How do you understand stress?",
    "What are the different types of therapy?",
    "How do psychologists study language?",
    "What is the difference between psychology and counseling?",
    "How do you understand decision-making?",
    "What are the key principles of developmental psychology?",
    "How do psychologists study attention?",
    "What is the difference between psychology and social work?",
    "How do you understand mental health?",
    "What are the different types of psychological assessments?",
    "How do psychologists study group behavior?",
    "What is the difference between psychology and anthropology?",
    "How do you understand psychological resilience?",
    "What are the key theories of emotion?",
    "How do psychologists study problem-solving?",
    "What is the difference between psychology and biology?",
    "How do you understand psychological well-being?",
    "What are the different types of psychological research methods?",
    "How do psychologists study human relationships?",
    "What is the difference between psychology and psychotherapy?",
    "How do you understand psychological disorders?",
    "What are the essential tips for studying psychology?",
    "How do psychologists apply research findings?"
  ],
  "religion": [
    "What are the major world religions?",
    "How do different religions view the concept of God?",
    "What is the difference between religion and spirituality?",
    "How do religious texts influence believers?",
    "What are the key beliefs of Christianity?",
    "How do different religions approach prayer?",
    "What is the difference between monotheism and polytheism?",
    "How do religions address questions of morality?",
    "What are the key beliefs of Islam?",
    "How do different religions view the afterlife?",
    "What is the difference between religion and philosophy?",
    "How do religions organize their communities?",
    "What are the key beliefs of Buddhism?",
    "How do different religions approach meditation?",
    "What is the difference between religion and mythology?",
    "How do religions influence culture?",
    "What are the key beliefs of Hinduism?",
    "How do different religions view suffering?",
    "What is the difference between religion and science?",
    "How do religions address questions of meaning?",
    "What are the key beliefs of Judaism?",
    "How do different religions approach rituals?",
    "What is the difference between religion and ethics?",
    "How do religions develop over time?",
    "What are the key beliefs of Sikhism?",
    "How do different religions view creation?",
    "What is the difference between religion and tradition?",
    "How do religions address questions of truth?",
    "What are the key beliefs of Taoism?",
    "How do different religions approach worship?",
    "What is the difference between religion and cult?",
    "How do religions influence politics?",
    "What are the key beliefs of Confucianism?",
    "How do different religions view human nature?",
    "What is the difference between religion and superstition?",
    "How do religions address questions of purpose?",
    "What are the key beliefs of Shinto?",
    "How do different religions approach fasting?",
    "What is the difference between religion and belief?",
    "How do religions influence art?",
    "What are the key principles of religious tolerance?",
    "How do different religions view the divine?",
    "What is the difference between religion and faith?",
    "How do religions address questions of existence?",
    "What are the key beliefs of Jainism?",
    "How do different religions approach pilgrimage?",
    "What is the difference between religion and ideology?",
    "How do religions influence society?",
    "What are the essential elements of religious practice?",
    "How do religions address questions of salvation?"
  ],
  "astronomy": [
    "What are the different types of stars?",
    "How do planets form?",
    "What is the difference between a star and a planet?",
    "How do astronomers measure distances in space?",
    "What are the different types of galaxies?",
    "How do black holes form?",
    "What is the difference between a comet and an asteroid?",
    "How do astronomers study the universe?",
    "What are the phases of the moon?",
    "How do solar systems form?",
    "What is the difference between astronomy and astrology?",
    "How do astronomers detect exoplanets?",
    "What are the different types of telescopes?",
    "How do stars produce energy?",
    "What is the difference between a nebula and a galaxy?",
    "How do astronomers measure the age of the universe?",
    "What are the different types of cosmic objects?",
    "How do supernovae occur?",
    "What is the difference between astronomy and cosmology?",
    "How do astronomers study dark matter?",
    "What are the different types of planetary systems?",
    "How do galaxies evolve?",
    "What is the difference between a meteor and a meteorite?",
    "How do astronomers study the Big Bang?",
    "What are the different types of stellar evolution?",
    "How do planets orbit stars?",
    "What is the difference between astronomy and astrophysics?",
    "How do astronomers study cosmic radiation?",
    "What are the different types of space missions?",
    "How do neutron stars form?",
    "What is the difference between a solar and lunar eclipse?",
    "How do astronomers study the cosmic microwave background?",
    "What are the different types of star clusters?",
    "How do planetary rings form?",
    "What is the difference between astronomy and space science?",
    "How do astronomers study gravitational waves?",
    "What are the different types of cosmic phenomena?",
    "How do white dwarfs form?",
    "What is the difference between astronomy and planetary science?",
    "How do astronomers study dark energy?",
    "What are the different types of observational methods?",
    "How do asteroids impact planets?",
    "What is the difference between astronomy and space exploration?",
    "How do astronomers study the structure of the universe?",
    "What are the different types of stellar classifications?",
    "How do planetary atmospheres form?",
    "What is the difference between astronomy and space technology?",
    "How do astronomers study the expansion of the universe?",
    "What are the essential tools for amateur astronomers?",
    "How do astronomers discover new celestial objects?"
  ],
  "marine_biology": [
    "What are the different types of marine ecosystems?",
    "How do marine animals adapt to ocean depths?",
    "What is the difference between marine and freshwater biology?",
    "How do coral reefs form?",
    "What are the different types of marine life?",
    "How do marine biologists study ocean life?",
    "What is the difference between plankton and nekton?",
    "How do marine animals communicate?",
    "What are the key threats to marine ecosystems?",
    "How do marine animals navigate?",
    "What is the difference between marine and aquatic biology?",
    "How do marine food webs work?",
    "What are the different types of ocean zones?",
    "How do marine animals reproduce?",
    "What is the difference between marine and oceanography?",
    "How do marine biologists conduct research?",
    "What are the different types of marine habitats?",
    "How do marine animals survive extreme pressure?",
    "What is the difference between marine and limnology?",
    "How do marine ecosystems function?",
    "What are the different types of marine conservation methods?",
    "How do marine animals adapt to temperature changes?",
    "What is the difference between marine and fisheries science?",
    "How do marine biologists study behavior?",
    "What are the different types of marine organisms?",
    "How do marine animals migrate?",
    "What is the difference between marine and coastal biology?",
    "How do marine biologists study populations?",
    "What are the different types of marine research techniques?",
    "How do marine animals defend themselves?",
    "What is the difference between marine and estuarine biology?",
    "How do marine ecosystems respond to climate change?",
    "What are the different types of marine species?",
    "How do marine animals find food?",
    "What is the difference between marine and deep-sea biology?",
    "How do marine biologists study genetics?",
    "What are the different types of marine adaptations?",
    "How do marine animals regulate buoyancy?",
    "What is the difference between marine and pelagic biology?",
    "How do marine biologists study ecology?",
    "What are the different types of marine conservation strategies?",
    "How do marine animals sense their environment?",
    "What is the difference between marine and benthic biology?",
    "How do marine biologists study evolution?",
    "What are the different types of marine research methods?",
    "How do marine animals interact with their environment?",
    "What is the difference between marine and tropical biology?",
    "How do marine biologists study biodiversity?",
    "What are the essential skills for marine biologists?",
    "How do marine ecosystems maintain balance?"
  ],
  "gaming": [
    "What are the different types of video game genres?",
    "How do game developers create game mechanics?",
    "What is the difference between single-player and multiplayer games?",
    "How do you improve your gaming skills?",
    "What are the key elements of game design?",
    "How do game engines work?",
    "What is the difference between casual and hardcore gaming?",
    "How do you build a gaming PC?",
    "What are the different types of gaming platforms?",
    "How do game developers balance gameplay?",
    "What is the difference between game design and game development?",
    "How do you optimize game performance?",
    "What are the key principles of level design?",
    "How do game developers create narratives?",
    "What is the difference between indie and AAA games?",
    "How do you stream games?",
    "What are the different types of game controllers?",
    "How do game developers test games?",
    "What is the difference between game art and game design?",
    "How do you mod games?",
    "What are the key elements of game programming?",
    "How do game developers monetize games?",
    "What is the difference between game genres?",
    "How do you improve your reaction time in games?",
    "What are the different types of game mechanics?",
    "How do game developers create sound design?",
    "What is the difference between game development and game publishing?",
    "How do you build game communities?",
    "What are the key principles of game balance?",
    "How do game developers create AI?",
    "What is the difference between game design and game art?",
    "How do you optimize gaming setups?",
    "What are the different types of game modes?",
    "How do game developers create graphics?",
    "What is the difference between game development and game programming?",
    "How do you improve your gaming strategy?",
    "What are the key elements of game storytelling?",
    "How do game developers create multiplayer experiences?",
    "What is the difference between game genres and game types?",
    "How do you build game prototypes?",
    "What are the different types of game assets?",
    "How do game developers create user interfaces?",
    "What is the difference between game development and game design?",
    "How do you improve your gaming reflexes?",
    "What are the key principles of game accessibility?",
    "How do game developers create game worlds?",
    "What is the difference between game development and game production?",
    "How do you build game portfolios?",
    "What are the essential skills for game developers?",
    "How do game developers create engaging gameplay?"
  ],
  "automotive": [
    "What are the different types of car engines?",
    "How do you maintain a car?",
    "What is the difference between manual and automatic transmission?",
    "How do car engines work?",
    "What are the essential car maintenance tasks?",
    "How do you diagnose car problems?",
    "What is the difference between front-wheel and rear-wheel drive?",
    "How do you change a tire?",
    "What are the different types of car fuels?",
    "How do car brakes work?",
    "What is the difference between hybrid and electric cars?",
    "How do you check car fluids?",
    "What are the key components of a car?",
    "How do car suspensions work?",
    "What is the difference between car makes and models?",
    "How do you buy a used car?",
    "What are the different types of car insurance?",
    "How do car air conditioning systems work?",
    "What is the difference between car maintenance and car repair?",
    "How do you improve fuel efficiency?",
    "What are the essential car safety features?",
    "How do car electrical systems work?",
    "What is the difference between car types?",
    "How do you winterize a car?",
    "What are the different types of car tires?",
    "How do car cooling systems work?",
    "What is the difference between car leasing and buying?",
    "How do you maintain car batteries?",
    "What are the key principles of car design?",
    "How do car exhaust systems work?",
    "What is the difference between car performance and efficiency?",
    "How do you troubleshoot car issues?",
    "What are the different types of car modifications?",
    "How do car steering systems work?",
    "What is the difference between car brands?",
    "How do you prepare a car for long trips?",
    "What are the essential car tools?",
    "How do car transmissions work?",
    "What is the difference between car maintenance schedules?",
    "How do you improve car performance?",
    "What are the different types of car services?",
    "How do car fuel systems work?",
    "What is the difference between car repair and car restoration?",
    "How do you maintain car interiors?",
    "What are the key principles of car safety?",
    "How do car emissions systems work?",
    "What is the difference between car maintenance and car care?",
    "How do you choose the right car?",
    "What are the essential tips for car owners?",
    "How do car systems work together?"
  ]
}

